# -*- coding: utf-8 -*-

L = ['Michael', 'Sarah', 'Tracy', 'Bob', 'Jack']

# 切片，含头不含尾
print(L[0:3])

print(L[:3])

print(L[:-1]) # 从0开始，获取到倒数第一个

print(L[:-2]) # 从0开始，获取到倒数第二个

# 复制
L2 = L[:]

# ::
# 前10个数，每两个取一个
L = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(L[:10:2])  # [1, 3, 5, 7, 9]

# 所有数，每三个取一个
L = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(L[::3])  # [1, 4, 7, 10]

# 获取逆序数列
L = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(L[::-1])  # [10, 9, 8, 7, 6, 5, 4, 3, 2, 1]

# 所有数，从最后开始，每两个取一个
print(L[::-2])  # [10, 8, 6, 4, 2]


# tuple 也可以切片，切片下来的还是一个 Tuple
t = (0, 1, 2, 3, 4, 5)[:3]  # (0, 1, 2)
print(t)

# 字符串也可以切片
str = 'ABCDEFG'[1:3]
print(str)  # BC
